In [1]:
import pandas as pd
import numpy as np

In [2]:
file_path = "../Resources/national_M2021_dl.csv"
wages_df = pd.read_csv(file_path)
wages_df

,AREA,AREA_TITLE,AREA_TYPE,PRIM_STATE,NAICS,NAICS_TITLE,I_GROUP,OWN_CODE,OCC_CODE,OCC_TITLE,...,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90,ANNUAL,HOURLY
0,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,00-0000,All Occupations,...,22.00,32.98,49.43,"23,980","29,950","45,760","68,590","102,810",NaN,NaN
1,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,11-0000,Management Occupations,...,49.25,77.39,#,"47,860","74,710","102,450","160,960",#,NaN,NaN
2,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,11-1000,Top Executives,...,47.46,77.18,#,"41,260","60,900","98,720","160,540",#,NaN,NaN
3,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,11-1010,Chief Executives,...,86.31,#,#,"60,300","111,080","179,520",#,#,NaN,NaN
4,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,11-1011,Chief Executives,...,86.31,#,#,"60,300","111,080","179,520",#,#,NaN,NaN
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1398,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,53-7081,Refuse and Recyclable Material Collectors,...,18.51,23.50,29.96,"24,950","30,270","38,500","48,870","62,310",NaN,NaN
1399,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,53-7120,"Tank Car, Truck, and Ship Loaders",...,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860",NaN,NaN
1400,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,53-7121,"Tank Car, Truck, and Ship Loaders",...,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860",NaN,NaN
1401,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,53-7190,Miscellaneous Material Moving Workers,...,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830",NaN,NaN
1402,99,U.S.,1,US,0,Cross-industry,cross-industry,1235,53-7199,"Material Moving Workers, All Other",...,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830",NaN,NaN

In [3]:
print(wages_df["OCC_TITLE"].count)

<bound method Series.count of 0                                 All Occupations
1                          Management Occupations
2                                  Top Executives
3                                Chief Executives
4                                Chief Executives
                          ...
1398    Refuse and Recyclable Material Collectors
1399            Tank Car, Truck, and Ship Loaders
1400            Tank Car, Truck, and Ship Loaders
1401        Miscellaneous Material Moving Workers
1402           Material Moving Workers, All Other
Name: OCC_TITLE, Length: 1403, dtype: object>

In [4]:
wages_df.dtypes

AREA              int64
AREA_TITLE       object
AREA_TYPE         int64
PRIM_STATE       object
NAICS             int64
NAICS_TITLE      object
I_GROUP          object
OWN_CODE          int64
OCC_CODE         object
OCC_TITLE        object
O_GROUP          object
TOT_EMP          object
EMP_PRSE        float64
JOBS_1000       float64
LOC_QUOTIENT    float64
PCT_TOTAL       float64
PCT_RPT         float64
H_MEAN           object
A_MEAN           object
MEAN_PRSE        object
H_PCT10          object
H_PCT25          object
H_MEDIAN         object
H_PCT75          object
H_PCT90          object
A_PCT10          object
A_PCT25          object
A_MEDIAN         object
A_PCT75          object
A_PCT90          object
ANNUAL           object
HOURLY           object
dtype: object

In [5]:
print(wages_df["OCC_TITLE"].head())

0           All Occupations
1    Management Occupations
2            Top Executives
3          Chief Executives
4          Chief Executives
Name: OCC_TITLE, dtype: object

In [6]:
print(wages_df["OCC_TITLE"].tail())

1398    Refuse and Recyclable Material Collectors
1399            Tank Car, Truck, and Ship Loaders
1400            Tank Car, Truck, and Ship Loaders
1401        Miscellaneous Material Moving Workers
1402           Material Moving Workers, All Other
Name: OCC_TITLE, dtype: object

In [7]:
# Cleaning DataFrame by dropping unnecessary columns df.drop(columns=['B', 'C'], axis=1) axis=1 drops the whole column Stackoverflow

wages_df = wages_df.drop(columns=['AREA', 'AREA_TITLE', 'AREA_TYPE', 'PRIM_STATE', 'NAICS', 'NAICS_TITLE', 'I_GROUP', 'OWN_CODE', 'ANNUAL', 'HOURLY'], axis=1)

In [8]:
# Cleaning columns
wages_df

,OCC_CODE,OCC_TITLE,O_GROUP,TOT_EMP,EMP_PRSE,JOBS_1000,LOC_QUOTIENT,PCT_TOTAL,PCT_RPT,H_MEAN,...,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90
0,00-0000,All Occupations,total,"140,886,310",0.0,NaN,NaN,NaN,NaN,28.01,...,11.53,14.40,22.00,32.98,49.43,"23,980","29,950","45,760","68,590","102,810"
1,11-0000,Management Occupations,major,"8,909,910",0.2,NaN,NaN,NaN,NaN,59.31,...,23.01,35.92,49.25,77.39,#,"47,860","74,710","102,450","160,960",#
2,11-1000,Top Executives,minor,"3,229,990",0.4,NaN,NaN,NaN,NaN,57.94,...,19.84,29.28,47.46,77.18,#,"41,260","60,900","98,720","160,540",#
3,11-1010,Chief Executives,broad,"200,480",1.6,NaN,NaN,NaN,NaN,102.41,...,28.99,53.40,86.31,#,#,"60,300","111,080","179,520",#,#
4,11-1011,Chief Executives,detailed,"200,480",1.6,NaN,NaN,NaN,NaN,102.41,...,28.99,53.40,86.31,#,#,"60,300","111,080","179,520",#,#
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1398,53-7081,Refuse and Recyclable Material Collectors,detailed,"126,050",1.5,NaN,NaN,NaN,NaN,20.57,...,11.99,14.56,18.51,23.50,29.96,"24,950","30,270","38,500","48,870","62,310"
1399,53-7120,"Tank Car, Truck, and Ship Loaders",broad,"12,090",6.8,NaN,NaN,NaN,NaN,26.60,...,15.91,18.54,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860"
1400,53-7121,"Tank Car, Truck, and Ship Loaders",detailed,"12,090",6.8,NaN,NaN,NaN,NaN,26.60,...,15.91,18.54,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860"
1401,53-7190,Miscellaneous Material Moving Workers,broad,"22,470",4.7,NaN,NaN,NaN,NaN,19.32,...,13.68,14.40,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830"
1402,53-7199,"Material Moving Workers, All Other",detailed,"22,470",4.7,NaN,NaN,NaN,NaN,19.32,...,13.68,14.40,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830"

In [9]:
wages_df = wages_df.drop(columns=['OCC_CODE', 'O_GROUP', 'JOBS_1000', 'LOC_QUOTIENT', 'PCT_TOTAL', 'PCT_RPT'], axis=1)

In [10]:
wages_df
# Do we need EMP_PRSE?

,OCC_TITLE,TOT_EMP,EMP_PRSE,H_MEAN,A_MEAN,MEAN_PRSE,H_PCT10,H_PCT25,H_MEDIAN,H_PCT75,H_PCT90,A_PCT10,A_PCT25,A_MEDIAN,A_PCT75,A_PCT90
0,All Occupations,"140,886,310",0.0,28.01,"58,260",0.1,11.53,14.40,22.00,32.98,49.43,"23,980","29,950","45,760","68,590","102,810"
1,Management Occupations,"8,909,910",0.2,59.31,"123,370",0.3,23.01,35.92,49.25,77.39,#,"47,860","74,710","102,450","160,960",#
2,Top Executives,"3,229,990",0.4,57.94,"120,520",0.4,19.84,29.28,47.46,77.18,#,"41,260","60,900","98,720","160,540",#
3,Chief Executives,"200,480",1.6,102.41,"213,020",0.8,28.99,53.40,86.31,#,#,"60,300","111,080","179,520",#,#
4,Chief Executives,"200,480",1.6,102.41,"213,020",0.8,28.99,53.40,86.31,#,#,"60,300","111,080","179,520",#,#
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
1398,Refuse and Recyclable Material Collectors,"126,050",1.5,20.57,"42,780",0.7,11.99,14.56,18.51,23.50,29.96,"24,950","30,270","38,500","48,870","62,310"
1399,"Tank Car, Truck, and Ship Loaders","12,090",6.8,26.60,"55,330",2.6,15.91,18.54,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860"
1400,"Tank Car, Truck, and Ship Loaders","12,090",6.8,26.60,"55,330",2.6,15.91,18.54,23.75,37.31,38.39,"33,090","38,570","49,390","77,610","79,860"
1401,Miscellaneous Material Moving Workers,"22,470",4.7,19.32,"40,190",1.8,13.68,14.40,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830"
1402,"Material Moving Workers, All Other","22,470",4.7,19.32,"40,190",1.8,13.68,14.40,17.38,22.78,29.24,"28,450","29,960","36,150","47,380","60,830"

In [11]:
wages_df["OCC_TITLE"].unique()

array(['All Occupations', 'Management Occupations', 'Top Executives', ...,
       'Tank Car, Truck, and Ship Loaders',
       'Miscellaneous Material Moving Workers',
       'Material Moving Workers, All Other'], dtype=object)

In [12]:
wages_df = wages_df.drop(columns=['EMP_PRSE', 'MEAN_PRSE', 'H_PCT10', 'H_PCT25', 'H_PCT75', 'H_PCT90', 'A_PCT10', 'A_PCT25', 'A_PCT75', 'A_PCT90'], axis=1)

In [13]:
wages_df.head()

                OCC_TITLE      TOT_EMP  H_MEAN   A_MEAN H_MEDIAN A_MEDIAN
0         All Occupations  140,886,310   28.01   58,260    22.00   45,760
1  Management Occupations    8,909,910   59.31  123,370    49.25  102,450
2          Top Executives    3,229,990   57.94  120,520    47.46   98,720
3        Chief Executives      200,480  102.41  213,020    86.31  179,520
4        Chief Executives      200,480  102.41  213,020    86.31  179,520

In [14]:
wages_df.dtypes

OCC_TITLE    object
TOT_EMP      object
H_MEAN       object
A_MEAN       object
H_MEDIAN     object
A_MEDIAN     object
dtype: object

In [15]:
wages_df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1403 entries, 0 to 1402
Data columns (total 6 columns):
 #   Column     Non-Null Count  Dtype
---  ------     --------------  -----
 0   OCC_TITLE  1403 non-null   object
 1   TOT_EMP    1403 non-null   object
 2   H_MEAN     1403 non-null   object
 3   A_MEAN     1403 non-null   object
 4   H_MEDIAN   1403 non-null   object
 5   A_MEDIAN   1403 non-null   object
dtypes: object(6)
memory usage: 65.9+ KB

In [16]:
wages_df.head()

                OCC_TITLE      TOT_EMP  H_MEAN   A_MEAN H_MEDIAN A_MEDIAN
0         All Occupations  140,886,310   28.01   58,260    22.00   45,760
1  Management Occupations    8,909,910   59.31  123,370    49.25  102,450
2          Top Executives    3,229,990   57.94  120,520    47.46   98,720
3        Chief Executives      200,480  102.41  213,020    86.31  179,520
4        Chief Executives      200,480  102.41  213,020    86.31  179,520

In [17]:
# Getting rid of duplicates, Pandas documentation https://pandas.pydata.org/docs/reference/api/pandas.DataFrame.drop_duplicates.html

cleanwages_df = wages_df.drop_duplicates()

In [18]:
# Resetting index after dropping duplicates. https://stackoverflow.com/questions/28885073/reindexing-after-pandas-drop-duplicates
cleanwages_df = cleanwages_df.reset_index(drop=True)

In [19]:
# checking the index
cleanwages_df.head()

,OCC_TITLE,TOT_EMP,H_MEAN,A_MEAN,H_MEDIAN,A_MEDIAN
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"

In [20]:
cleanwages_df = cleanwages_df.dropna(axis=0, how='any')
cleanwages_df.head()

,OCC_TITLE,TOT_EMP,H_MEAN,A_MEAN,H_MEDIAN,A_MEDIAN
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"

In [21]:
for col in cleanwages_df.columns:
    print(col)

OCC_TITLE
TOT_EMP
H_MEAN
A_MEAN
H_MEDIAN
A_MEDIAN

In [22]:
# Rename the headers
clean_df = cleanwages_df.rename(columns={"OCC_TITLE": "Occupation",
"TOT_EMP": "Total Employees",
"H_MEAN": "Hourly Mean",
"A_MEAN": "Annual Mean",
"H_MEDIAN": "Hourly Median",
"A_MEDIAN": "Annual Median",})

clean_df.head()

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"

In [23]:
# Dropping row with special value (*)
cross_industry_df = clean_df.drop(5)

In [24]:
# Resetting the index after dropping rows.
cross_industry_df = cross_industry_df.reset_index(drop=True)

In [25]:
cross_industry_df.head()

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"

In [26]:
cross_industry_df.loc[cross_industry_df["Hourly Mean"].ne('*'), :]

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"
...,...,...,...,...,...,...
1133,Wellhead Pumpers,"16,040",32.29,"67,170",30.64,"63,740"
1134,Refuse and Recyclable Material Collectors,"126,050",20.57,"42,780",18.51,"38,500"
1135,"Tank Car, Truck, and Ship Loaders","12,090",26.60,"55,330",23.75,"49,390"
1136,Miscellaneous Material Moving Workers,"22,470",19.32,"40,190",17.38,"36,150"
1137,"Material Moving Workers, All Other","22,470",19.32,"40,190",17.38,"36,150"

In [27]:
cross_industry_df.loc[cross_industry_df["Hourly Median"].ne('*'), :]

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"
...,...,...,...,...,...,...
1133,Wellhead Pumpers,"16,040",32.29,"67,170",30.64,"63,740"
1134,Refuse and Recyclable Material Collectors,"126,050",20.57,"42,780",18.51,"38,500"
1135,"Tank Car, Truck, and Ship Loaders","12,090",26.60,"55,330",23.75,"49,390"
1136,Miscellaneous Material Moving Workers,"22,470",19.32,"40,190",17.38,"36,150"
1137,"Material Moving Workers, All Other","22,470",19.32,"40,190",17.38,"36,150"

In [28]:
# Removing * is DataFrame
cross_industry_df = cross_industry_df.loc[cross_industry_df.ne('*').any(axis=1), :]

In [29]:
cross_industry_df = cross_industry_df.loc[cross_industry_df.ne('#').any(axis=1), :]

In [30]:
# checking for * in DataFrame
cross_industry_df.ne('*').any(axis=1)

0       True
1       True
2       True
3       True
4       True
        ...
1133    True
1134    True
1135    True
1136    True
1137    True
Length: 1138, dtype: bool

In [31]:
cross_industry_df = (cross_industry_df
 .replace('#', np.nan)
 .replace('*', np.nan)
 .dropna()
)

cross_industry_df.head()

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,"140,886,310",28.01,"58,260",22.00,"45,760"
1,Management Occupations,"8,909,910",59.31,"123,370",49.25,"102,450"
2,Top Executives,"3,229,990",57.94,"120,520",47.46,"98,720"
3,Chief Executives,"200,480",102.41,"213,020",86.31,"179,520"
4,General and Operations Managers,"2,984,920",55.41,"115,250",47.10,"97,970"

In [32]:
# print(df.drop(df[df.ID.str.contains(r'[^0-9a-zA-Z]') |
#                  df.Name.str.contains(r'[^0-9a-zA-Z]') |
#                  df.Age.str.contains(r'[^0-9a-zA-Z]') |
#                  df.Country.str.contains(r'[^0-9a-zA-Z]')].index))

In [33]:
# Removing * from DataFrame

#cross_industry_df['Hourly Mean'].replace('\*','',regex=True).astype(float)

#cross_industry_df["Hourly Mean"] = cross_industry_df["Hourly Mean"].str.replace('\\*', "")

In [34]:
# Trying to convert columns into int and float but unable due to error 
# ValueError: invalid literal for int() with base 10: '28.01'


#cross_industry_df['Hourly Mean'].astype(str)

In [35]:
# Removing special characters from DataFrame 
#df_converting=cross_industry_df.replace('\*|#', np.nan, regex=True)

In [36]:
integer_columns = ['Total Employees', 'Annual Mean', 'Annual Median']
cross_industry_df[integer_columns] = cross_industry_df[integer_columns].replace(',', '', regex=True)

In [37]:
# annual_median = ['Annual Median']
# df_converting[annual_median] = df_converting[annual_median].replace('', np.nan, regex=True)

In [38]:
# df_converting['Hourly Mean'] = df_converting['Hourly Mean'].astype(float) works!
# df_converting

In [39]:
# Add df = 
cross_industry_df.astype({
    'Hourly Mean':float,
    'Hourly Median':float,
    'Total Employees':float,
    'Annual Mean':float,
    'Annual Median':float,
}).dtypes

Occupation          object
Total Employees    float64
Hourly Mean        float64
Annual Mean        float64
Hourly Median      float64
Annual Median      float64
dtype: object

In [46]:
cross_industry_df

,Occupation,Total Employees,Hourly Mean,Annual Mean,Hourly Median,Annual Median
0,All Occupations,140886310,28.01,58260,22.00,45760
1,Management Occupations,8909910,59.31,123370,49.25,102450
2,Top Executives,3229990,57.94,120520,47.46,98720
3,Chief Executives,200480,102.41,213020,86.31,179520
4,General and Operations Managers,2984920,55.41,115250,47.10,97970
...,...,...,...,...,...,...
1133,Wellhead Pumpers,16040,32.29,67170,30.64,63740
1134,Refuse and Recyclable Material Collectors,126050,20.57,42780,18.51,38500
1135,"Tank Car, Truck, and Ship Loaders",12090,26.60,55330,23.75,49390
1136,Miscellaneous Material Moving Workers,22470,19.32,40190,17.38,36150
1137,"Material Moving Workers, All Other",22470,19.32,40190,17.38,36150

In [40]:
# df_converting = cross_industry_df['Hourly Mean'].astype('string')
#df_converting.dtypes

In [41]:
# This line of code will run if I remove the regex=True. 
# df_converting=cross_industry_df.replace('\*', np.nan, regex=True)

#df_converting[df_converting.str.contains('')==False]

In [42]:
# This line of code returns an error indicating there are still *'s in the data set 
# df_converting.astype('float')

# ValueError: Must provide strings.

In [43]:
# found on stack overflow df[df['my_var']=='*']    https://stackoverflow.com/questions/45177209/error-unable-to-parse-string-at-position-6116-convert-object-type-to-int
# remove all except decimal point https://stackoverflow.com/questions/68678098/python-regex-remove-all-and-special-characters-except-the-decimal-point
# value error invalid literal for int() with base 10:   https://stackoverflow.com/questions/1841565/valueerror-invalid-literal-for-int-with-base-10

In [45]:
# Exporting DataFrame to csv for tableau

cross_industry_df.to_csv("../Clean Data/clean_national_M2021_dl.csv", index = False)